Project/Toir/src/DataProcessors/НастройкаНаследованияСтрокТабличныхЧастей/НастройкаНаследованияСтрокТабличныхЧастей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>НастройкаНаследованияСтрокТабличныхЧастей</name>
  <attributes>
    <name>Класс</name>
    <type>
      <types>CatalogRef.Классы</types>
    </type>
  </attributes>
  <attributes>
    <name>ТабличнаяЧасть</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.АтрибутыКласса</types>
    </type>
  </attributes>
  <attributes>
    <name>СтрокаТабЧасти</name>
    <type>
      <types>CatalogRef.Классы</types>
    </type>
  </attributes>
  <attributes>
    <name>ИсточникЗначений</name>
    <type>
      <types>CatalogRef.Классы</types>
    </type>
  </attributes>
  <tabularSections>
    <name>СтрокиДляНастройки</name>
    <attributes>
      <name>Выбрано</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Класс</name>
      <type>
        <types>CatalogRef.Классы</types>
      </type>
    </attributes>
    <attributes>
      <name>Строка</name>
      <type>
        <types>CatalogRef.Классы</types>
      </type>
    </attributes>
    <attributes>
      <name>СтатусНаследования</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИсточникЗначений</name>
      <type>
        <types>CatalogRef.Классы</types>
        <types>CatalogRef.НоменклатураКласса</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

Project/Toir/src/Catalogs/Классы/Классы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Классы</name>
  <hierarchical>true</hierarchical>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <predefined>
    <items>
      <name>ВидыТехОпераций</name>
      <description>Виды тех.операции</description>
    </items>
    <items>
      <name>ВложенныеТехКарты</name>
      <description>Вложенные тех карты</description>
    </items>
    <items>
      <name>КлассыТехКарт</name>
      <description>Классы тех. карт</description>
    </items>
    <items>
      <name>СтрокиТехОпераций</name>
      <description>Строки тех.операций</description>
    </items>
    <items>
      <name>ТехнологическиеКарты</name>
      <description>Технологические карты</description>
    </items>
    <items>
      <name>ТипыТехКарт</name>
      <description>Типы тех. карт</description>
    </items>
    <items>
      <name>Оборудование</name>
      <description>Оборудование</description>
    </items>
  </predefined>
  <attributes>
    <name>НаименованиеПолное</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыОбъектовНСИ</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтображатьВИерархииТО</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗначениеАтрибута</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НоменклатураКласса</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбъектыНоменклатуры</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КлассТабличнаяЧасть</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ШаблонКодаКласса</name>
    <type>
      <types>CatalogRef.ШаблоныЗаполнения</types>
    </type>
  </attributes>
  <attributes>
    <name>ФорматКодаКласса</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ШаблонНаименованияКласса</name>
    <type>
      <types>CatalogRef.ШаблоныЗаполнения</types>
    </type>
  </attributes>
  <attributes>
    <name>ШаблонКодаНоменклатуры</name>
    <type>
      <types>CatalogRef.ШаблоныЗаполнения</types>
    </type>
  </attributes>
  <attributes>
    <name>ФорматКодаНоменклатуры</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ШаблонНаименованияНоменклатуры</name>
    <type>
      <types>CatalogRef.ШаблоныЗаполнения</types>
    </type>
  </attributes>
  <attributes>
    <name>ШаблонКодаОбъекта</name>
    <type>
      <types>CatalogRef.ШаблоныЗаполнения</types>
    </type>
  </attributes>
  <attributes>
    <name>ФорматКодаОбъекта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ШаблонНаименованияОбъекта</name>
    <type>
      <types>CatalogRef.ШаблоныЗаполнения</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетчикКлассов</name>
    <type>
      <types>CatalogRef.Счетчики</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетчикНоменклатуры</name>
    <type>
      <types>CatalogRef.Счетчики</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетчикОбъектовНоменклатуры</name>
    <type>
      <types>CatalogRef.Счетчики</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерПоСчетчику</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>11</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ШагСчетчика</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>11</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПрисвоенНомерПоШаблону</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РежимКонтроляДублейПоНаименованию</name>
    <type>
      <types>EnumRef.РежимыКонтроляДублей</types>
    </type>
  </attributes>
  <attributes>
    <name>КонтрольДублейВПределахКласса</name>
    <type>
      <types>CatalogRef.Классы</types>
    </type>
  </attributes>
</mdclass:Catalog>

Project/Toir/src/DataProcessors/НастройкаНаследованияСтрокТабличныхЧастей/Forms/ФормаВыбораТабЧасти/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Параметры.Свойство("Класс", Объект.Класс);
	
	ТекТабличнаяЧасть = Неопределено;
	Параметры.Свойство("ТекущаяСтрока", ТекТабличнаяЧасть);
	
	ЗаполнитьДеревоВыбора(ТекТабличнаяЧасть);
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоВыбораТабЧастиВыборЗначения(Элемент, Значение, СтандартнаяОбработка)
	
	ТекСтрока = ДеревоВыбораТабЧасти.НайтиПоИдентификатору(Значение);
	Если НЕ ТекСтрока = Неопределено Тогда
		ЗначениеВыбора = Новый Структура("ТабличнаяЧасть, ИсточникЗначений", ТекСтрока.ТабличнаяЧасть, ТекСтрока.ИсточникЗначений);
		ОповеститьОВыборе(ЗначениеВыбора);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДеревоВыбора(ТекТабличнаяЧасть)
	
	ТекСтрока = Неопределено;
	
	ТипСтрока = Тип("Строка");
	
	СписокКлассов = Новый Массив;
	СписокКлассов.Добавить(Объект.Класс);
	
	СписокКлассовВложенных = Новый Массив;
	СоответствиеКлассовТабЧастей = Новый Соответствие;
	
	Пока СписокКлассов.Количество() > 0 Цикл
	
		СписокРодителей  = Справочники.Классы.ПолучитьТаблицуРодителей(СписокКлассов);
		ТаблицаАтрибутов = Справочники.Классы.ПолучитьТаблицуАтрибутов(СписокРодителей);
		
		Для Каждого СтрокаТЗ ИЗ ТаблицаАтрибутов Цикл 
			Если СтрокаТЗ.СтатусНаследования <= 3 
					И НЕ СтрокаТЗ.ТипЗначения.СодержитТип(ТипСтрока) 
					И СтрокаТЗ.МножественноеЗначение И СтрокаТЗ.КлассТабличнаяЧасть Тогда 
				
				Если СоответствиеКлассовТабЧастей[СтрокаТЗ.ИсточникЗначений] = Неопределено Тогда
					Если СтрокаТЗ.КлассДляЧтения = Справочники.Классы.СтрокиТехОпераций 
							ИЛИ СтрокаТЗ.КлассДляЧтения = Справочники.Классы.ВложенныеТехКарты Тогда
						КлассРодтель = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтрокаТЗ.КлассДляЧтения, "Родитель");
						СтрокаРодителя = СоответствиеКлассовТабЧастей[КлассРодтель];
					Иначе
						СтрокаРодителя = СоответствиеКлассовТабЧастей[СтрокаТЗ.КлассДляЧтения];
					КонецЕсли;
					
					Если НЕ СтрокаРодителя = Неопределено Тогда
						ПодстрокиРодителя = СтрокаРодителя.ПолучитьЭлементы();
					Иначе
						ПодстрокиРодителя = ДеревоВыбораТабЧасти.ПолучитьЭлементы();
					КонецЕсли;
					
					СтрокаДереваВыбора = ПодстрокиРодителя.Добавить();
					СтрокаДереваВыбора.ТабличнаяЧасть = СтрокаТЗ.АтрибутКласса;
					СтрокаДереваВыбора.ИсточникЗначений = СтрокаТЗ.ИсточникЗначений;
					СоответствиеКлассовТабЧастей.Вставить(СтрокаТЗ.ИсточникЗначений, СтрокаДереваВыбора);
					
					// Пока обработку вложенных таб.частей не добавляю. {
					//СписокКлассовВложенных.Добавить(СтрокаТЗ.ИсточникЗначений);
					//Если СтрокаТЗ.АтрибутКласса = ПланыВидовХарактеристик.АтрибутыКласса.ТехОперации Тогда
					//	СписокКлассовВложенных.Добавить(Справочники.Классы.СтрокиТехОпераций);
					//	СписокКлассовВложенных.Добавить(Справочники.Классы.ВложенныеТехКарты);
					//КонецЕсли; 
					//}
					
					Если ТекТабличнаяЧасть = СтрокаТЗ.АтрибутКласса Тогда
						ТекСтрока = СтрокаДереваВыбора;
					КонецЕсли;
				КонецЕсли;
				
			КонецЕсли;
		КонецЦикла;
		
		СписокВрем = СписокКлассов;
		СписокКлассов = СписокКлассовВложенных;
		СписокКлассовВложенных = СписокВрем;
		СписокКлассовВложенных.Очистить();
		
	КонецЦикла;
	
	Если НЕ ТекСтрока = Неопределено Тогда
		Элементы.ДеревоВыбораТабЧасти.ТекущаяСтрока = ТекСтрока.ПолучитьИдентификатор();
	КонецЕсли;
	
КонецПроцедуры
